Repository: zaib404/VirtualWelshWalk-WebApp
Catalog: VirtualWelshWalk/Resources/app.*.resx
Languages: cy

source: A new area of interest unlocked
cy: Maes newydd o ddiddordeb heb ei gloi

source: Add 1 step
cy: Ychwanegwch 1 cam

# Add Num Steps1
source: Add
cy: Ychwanegwch

# Add Num Steps2
source: steps
cy: cam

# Add Num Steps3
source: steps
cy: o gamau

source: Add steps
cy: Ychwanegu camau

source: Anglesey
cy: Sir Fôn

source: Are you sure you?
cy: Ydych chi'n siŵr eich bod chi?

source: Barafundle Bay
cy: Bae Barafundle

source: Barafundle Bay was named in Passport Magazine’s best beaches in the world. The remote sand patch came 17th in the top 25. Barafundle Bay is a remote, slightly curved, east-facing sandy beach in Pembrokeshire, Wales, near Stackpole Quay and is part of the Stackpole Estate, managed by The National Trust.
cy: Cafodd Bae Barafundle ei henwi fel un o traethau gorau’r byd yn ‘Passport Magazine’s’. Fe ddaeth Traeth Barafundle yn 17eg yn y 25 uchaf. Mae’n draeth anghysbell, weddol crwn, yn gwynebu’r dwyrain yn Sir Benfro, Cymru, ger Cei Ystangbwll ac yn rhan o ystâd Ystangbwll, a reolir gan Yr Ymddiriedolaeth Genedlaethol.

source: Barmouth
cy: Abermaw

source: Beaumaris Castle
cy: Castell Biwmares

source: Beaumaris on the island of Anglesey is famous as the greatest castle never built. It was the last of the royal strongholds created by Edward I in Wales – and perhaps his masterpiece. Beaumaris Castle was never fully built, but had it been completed it would probably have closely resembled Harlech Castle. Both castles are concentric in plan, with walls within walls, although Beaumaris is the more regular in design.
cy: Mae Castell Biwmaris ar ynys Sir Fôn yn enwog fel y castell gorau a chafodd fyth ei adeiladu. Hwn oedd yr olaf o’r cadarnleoedd brenhinol a grêwyd gan Edward y 1af yng Nghymru – ac efallai ei gampwaith. Cafodd Castell Biwmaris byth ei orffen, ond petai y gwaith adeiladu wedi ei orffen fyddai’n debyg iawn i Gastell Harlech. Mae’r ddau gastell yn ganolbwyntiol eu cynllun, gyda waliau o fewn waliau, er mai Biwmaris yw’r mwyaf rheolaidd o ran dyluniad.

source: Beddgelert is a village and community in the Snowdonia area of Gwynedd, Wales. It is reputed to be named after the legendary hound Gelert. Gelert is a legendary dog associated with the village of Beddgelert (whose name means "Gelert's Grave") in Gwynedd, north-west Wales. In the legend, Llywelyn the Great returns from hunting to find his baby missing, the cradle overturned, and Gelert with a blood-smeared mouth. Believing the dog had savaged the child, Llywelyn draws his sword and kills Gelert. After the dog's dying yelp Llywelyn hears the cries of the baby, unharmed under the cradle, along with a dead wolf which had attacked the child and been killed by Gelert. Llywelyn is overcome with remorse and buries the dog with great ceremony, but can still hear its dying yelp. After that day Llywelyn never smiles again.
cy: Mae Beddgelert yn bentref a cymuned yn Eryri, Gwynedd, Cymru. Honnir iddo gael ei enwi ar ôl y ci chwedlonol Gelert. Ci chwedlonol yw Gelert sy’n gysylltiedig â phentref Beddgelert yn Ngwynedd, gogled orllewin Cymru. Yn y chwedl, dychwelir Llywelyn o hela i ddod o hyd i’w fabi ar goll, y crud wedi’i wrthdroi, a Gelert â gwaed dros ei geg. Gan gredu mai Gelert achoswyd hyn, mae Llywelyn yn tynnu ei gleddyf ac yn lladd Gelert. Ar ôl i Gelert farw fe glywodd Llywelyn grio babi, yn ddianaf o dan y crud, ynghyd â blaidd marw a ymasododd y babi a gafodd ei ladd gan Gelert. Goresgynir Llywelyn gydag edifeirwch ac yn claddu Gelert â seremoni fawr. Ar ôl y diwrnod hwnnw nid yw Llywelyn byth yn gwenu eto.

source: Caernarfon Castle
cy: Castell Caernarfon

source: Caernarfon Castle is a medieval fortress in Caernarfon, Gwynedd, north-west Wales cared for by Cadw, the Welsh Government's historic environment service. It was a motte-and-bailey castle from the late 11th century until 1283 when King Edward I of England began to replace it with the current stone structure.
cy: Castell canoloesol yw Castell Caernarfon, Gwynedd, gogledd orllewin Cymru â gofalwyd gan Cadw, gwasanaeth Amgylchedd Hanesyddol Llywodraeth Cymru. Castell mwnt a beili oedd hi o’r 11eg ganrif hwyr i 1283 pryd ddechreuodd Brenin Lloegr Edward 1af ddisodli’r castell am y strwythur cerrig cyfredol.

source: Cardiff
cy: Caerdydd

source: Cardiff Castle
cy: Castell Caerdydd

source: Cardiff Castle is located in the Castle Quarter, in the heart of Cardiff, the capital of Wales. There has been a fort on the site for almost 2,000 years. The current building was built in the late 11th century, replacing a Roman fort.
cy: Mae Castell Caerdydd wedi’i leoli yng nghanol Caerdydd, prifddinas Cymru. Bu caer ar y safle ers bron i 2,000 o flynyddoedd. Adeiladwyd yr adeilad bresennol ar ddiwedd yr 11eg ganrif, gan ddisodli caer Rufeining.

source: Cardigan
cy: Aberteifi

source: Cardigan Castle
cy: Castell Aberteifi

source: Cardigan Castle is a castle overlooking the River Teifi in Cardigan, Ceredigion, Wales. The castle dates from the late 11th-century, though was rebuilt in 1244. Castle Green House was built inside the castle walls in the early 1800s.
cy: Mae Castell Aberteifi yn gorchwilio Afon Teifi yn Aberteifi, Ceredigion, Cymru. Mae’r castell yn dyddio yn ôl i ddiwedd y 11eg ganrif, ag ail-adeiladwyd yn 1244. Cafodd Castell Tŷ Gwyrdd ei adeiladu tu fewn i waliau y castell yn yr 1800au cynnar.

source: Carmarthen
cy: Caerfyrddin

source: Chepstow
cy: Cas-gwent

source: Chester
cy: Caer

source: City Walls
cy: Muriau’r Ddinas

source: Close
cy: Caewch

source: Confirm Password
cy: Cadarnhau Cyfrinair

source: Conwy Castle
cy: Castell Conwy

source: Conwy Castle (Welsh: Castell Conwy) is a fortification in Conwy, located in North Wales. It was built by Edward I, during his conquest of Wales, between 1283 and 1289. The castle hugs a rocky coastal ridge of grey sandstone and limestone, and much of the stone from the castle is largely taken from the ridge itself, probably when the site was first cleared.
cy: Amddiffynfa yw Castell Conwy yng Nghonwy, wedi’i leoli yng Ngogledd Cymru. Fe’i hadeiladwyd gan Edward y 1af yn ystod ei goncwest o Gymru, rhwng 1283 a 1289. Mae’r castell yn cofleidio crib arfordirol greigiog o dywodfaen llwyd a chalchfaen, a llawer o gerrig o’r castell yn cael ei cymryd i raddau health o’r grib ei hun, yn ôl pob tebyg pan gliriwyd y sfale gyntaf.

source: Create a new account
cy: Creu cyfrif newydd

source: Did you know
cy: Oeddet ti'n gwybod

source: Discover places of history along the way from Chepstow to Chester
cy: Darganfyddwch fannau hanes ar hyd y ffordd o Gas-gwent i Gaer

source: Do you wish to add new steps?
cy: Ydych chi am ychwanegu camau newydd?

source: Don't have an account?
cy: Peidiwch â chael cyfrif?

source: Email
cy: E-bost

source: Enter your steps
cy: Rhowch eich camau

source: Fall bay is one of the hardest to reach bays on Gower, however the walk is well worth it and the beach is never crowded due to its remoteness. There is no beach visible at high tide. The beach is very popular with surfers. At very low tide, it is possible to walk over from the beach to Mewslade Bay.
cy: Fall Bay yw un o’r traethau anoddaf i’w gyrraedd ar Gower, ond mae’n werth chweil cerdded yno ac nid yw’r traeth byth yn orlawn oherwydd ei bellenigrwydd. Ni does traeth i’w weld ar lanw uchel. Mae’r traeth boblogaidd iawn gyda syrffwyr. Ar lawn isel iawn, mae’n bosib cerdded o’r traeth i Fae Mewslade.

source: First Name
cy: Enw cyntaf

source: Fishguard
cy: Abergwaun

source: Forgot password
cy: Wedi anghofio cyfrinair

source: Harlech Castle
cy: Castell Harlech

source: Harlech Castle in Harlech, Gwynedd, Wales, is a medieval fortification built onto a rocky knoll close to the Irish Sea. It was built by Edward I during his invasion of Wales between 1282 and 1289 at the relatively modest cost of £8,190. Over the next few centuries, the castle played an important part in several wars, withstanding the siege of Madog ap Llywelyn between 1294–95, but falling to Owain Glyndŵr in 1404. It then became Glyndŵr's residence and military headquarters for the remainder of the uprising until being recaptured by English forces in 1409.
cy: Mae Castell Harlech, Gwynedd, Cymru, yn gastell canoloesol â adeiladwyd ar fryn ger y Môr Iwerydd. Fe adeiladwyd gan Edward 1af yn ystod ei oresgyniad o Gymru rhwn 1282 a 1289 am gost gymharol o £8,190. Dros y canrifoedd nesaf, chwaraeodd y castell ran bwysig mewn sawl rhyfel, yn gwrthsefyll gwarchae Madog ap Llywelyn rhwng 1294-95, ond yn cwympo i Owain Glyndŵr yn 1404. Yna daeth yn breswylfa a pencadlys milwrol Glyndŵr am weddill y gwrthryfela nes iddo ei ail-ddal gan luoedd Lloegr yn 1409.

source: Hello
cy: Helo

source: Home
cy: Hafan

source: JOIN NOW
cy: YMUNO NAWR

source: Kidwelly Castel
cy: Castell Cydweli

source: Kidwelly Castle is a Norman castle overlooking the River Gwendraeth and the town of Kidwelly, Carmarthenshire, Wales. Origin of this surname trace back to when it was spelled Cygweli which means "swan." Later in its history, it was unsuccessfully besieged by forces of Owain Glyndŵr in 1403 with assistance from soldiers from France and Brittany who captured Kidwelly town. The castle was relieved by a Norman army after just three weeks.
cy: Castell Normanaidd yw Castell Cydweli, sy’n gorchwylio Afon Gwendraeth a thrêf Cydweli. Sir Gaerfyrddin, Cymru. Tarddiad olrhain y cyfenw yn ôl i pan gafodd ei sillafu Cygweli sy’n golygu “alarch”. Hwyrach mewn hanes, cafodd ei gwarchae yn aflwyddiannus gan fyddin Owain Glyndŵr yn 1403 gyda chymorth milwyr o Ffrainc a Llydaw a gipiodd trêf Cydweli. Rhyddhawyd y castell gan fyddin Normanaidd ar ôl tair wythnos yn unig.

source: Last Name
cy: Enw olaf

source: Log in
cy: Mewngofnodi

source: Log out
cy: Allgofnodi

source: Miles
cy: Milltir

# milesaway1
source: miles
cy: milltir

# milesaway2
source: away
cy: i ffwrdd

source: Milford Haven
cy: Aberdaugleddau

source: Mumbles Pier
cy: Pier y Mwmbwls

source: Nant Gwrtheyrn is a Welsh Language and Heritage Centre, located near the village of Llithfaen on the northern coast of the Llŷn Peninsula, Gwynedd, in northwest Wales. The Centre specialises in Welsh for Adults (as a second language) and offers intensive residential courses throughout the year. Visitors to the area can enjoy our Heritage Centre which houses displays about the Welsh language and culture, as well as the history of the village which includes a period house set in a Victorian quarry community and information about the unique wildlife which can be discovered in this remote coastal valley and beach.
cy: Nant Gwrtheyrn yw Canolfan Iaith a Threftadaeth Cymru, wedi’i leoli ger pentref Llithfaen ar arfordir gogleddol y Llŷn Peninsula, Gwynedd, yng Ngogledd Cymru. Mae’r ganolfan yn arbenigo mewn cyrsiau Cymraeg i oedolion (fel ail iaith) ac yn cynnig cyrsiau dwys drwy gydol y flwyddyn. Mae ymwelydd i’r ardal yn gallu mwynhau ein Canolfan Treftadaeth sy’n arddangos gwybodaeth am iaith a diwylliant Cymru, yn ogystal a hanes y pentref sy’n cynnwys tŷ wedi’i leoli mewn cymuned chwarel oes Fictoria a gwybodaeth am y bywyd gwyllt unigryw a ellir ddarganfod yn y dyffryn a’r traeth arfordirol anghysbell hwn.

source: Newport
cy: Casnewydd

source: Next milestone
cy: Carreg filltir nesaf

source: Parc y Scarlets is a rugby union stadium in Llanelli, Carmarthenshire, that opened in November 2008 as the new home of the Scarlets and Llanelli RFC. The ground replaced Stradey Park, the home of Llanelli's rugby teams for almost 130 years. The stadium complex includes facilities for matchday supporters and for non-matchday revenue generation, as well as a training barn and a training pitch with athletics track.
cy: Stadiwm undeb rygbi yw Parc y Scarlets, Sir Gaerfyrddin, â agorwyd ym mis Tachwedd 2008 fel cartref newydd Scarlets a Llanelli RFC. Parc y Strade, cartref tîm rygbi Llanelli am bron i 130 o flynyddoedd oedd y safle cyn i Parc y Scarlets ei ddisodli. Mae’r stadiwm yn cynnwys cyfleusterau ar gyfer cefnogwyr gemau a chynyrchu refeniw o ddigwyddiadau eraill, yn ogystal ag ysgubor hyfforddi a chae hyfforddi gyda thrac athletau.

source: Password
cy: Cyfrinair

source: Pembrokeshire
cy: Sir Benfro

source: Plas Tan y Bwlch in Gwynedd, Wales, is the Snowdonia National Park Environmental Studies Centre, administered by the National Park Authority. The Centre aims to provide courses which are of interest to all lovers of the countryside who would like to know about this fascinating area of Wales.
cy: Plas Tan y Bwlch yng Ngwynedd, Cymru, yw Canolfan Astudiaethau Parc Cenedlaethol Eryri, gweinyddwyd gan Parc Awdurdod Cenedlaethol. Pwrpas y ganolfan yw i ddarparu cyrsiau sydd o ddiddordeb i bawb sy’n hôff o gefn gwlad a hoffai wybod am yr ardal hyfryd yma yng Nghymru.

source: Privacy Policy - Cookie Policy
cy: Polisi Preifatrwydd - Polisi Cwcis

source: Register
cy: Cofrestrwch

source: Register here
cy: Cofrestrwch yma

source: Remember me?
cy: Cofiwch fi?

source: Rest Bay Beach
cy: Traeth Rest Bay

source: Rest Bay is a golden, sandy beach on the outskirts of the town of Porthcawl, backed by The Royal Porthcawl Golf Club and low cliffs. The beach faces south-west, which means that it is not sheltered from the Atlantic winds and the waves here can be quite large, making it a good beach for surfing, as well as wind/kite surfing.
cy: Mae Traeth Rest Bay yn draeth euraidd, tywodlyd ar gyrion tref Porthcawl, gyda Chlwb Golf Brenhinol Porthcawl a chlogwyni isel yn gefn iddo. Mae’r traeth yn gwynebu de-orllewin, sy’n golygu nad yw’n cael ei gysgodi rhag y gwyntoedd atlantig a gall y tonnau yma fod yn eithaf mawr, gan ei wneud yn draeth da ar gyfer syrffio, yn ogystal â syrffio gwynt/barcud.

source: Rhossili
cy: Rhosili

source: Round House
cy: Tŷ crwn

source: Save changes
cy: Arbedwch newidiadau

source: St. Catherines Island
cy: Ynys Catrin

source: St. Catherines Island is a small tidal island linked to Tenby in Pembrokeshire, Wales. 2016 The Final Problem, the third and last episode of the fourth series of the BBC TV series Sherlock was filmed on the island, with it standing in as a maximum security prison. Formed from an outcrop of limestone, on average 25m high, the island is riddled with tidal caves.
cy: Ynys llanw fach yw Ynys Catrin, sy’n cysylltu â Dinbych-y-Pysgod yn Sir Benfro, Cymru. Ffilmiwyd ‘The Final Problem’, 2016, cyfres deledu BBC Sherlock, y drydydd bennod a’r olaf o’r bedwaredd gyfres ei ffilimio ar yr Ynys, gydag ef yn sefyll i mewn fel carchar. Mae’r Ynys llawn ogofâu llanw, a ffurfiwyd o brigiad o galchfaen ar gyfartaledd o 25m o uchder.

source: St. Davids
cy: Tyddewi

source: St. Davids Cathedral
cy: Eglwys Gadeiriol Tyddewi

source: St. Davids Cathedral is situated in St Davids in the county of Pembrokeshire, on the most westerly point of Wales. There are at least three services said or sung per day, each week, with sung services on five out of seven days. The cathedral choir at St Davids was the first cathedral choir in the United Kingdom to use girls and men as the main choir, rather than boys and men.
cy: Mae Eglwys Dewi Sant wedi’i leoli yn Nhyddewi yn Sir Benfro, ar bwynt mwyaf gorllweinol Cymru. Mae o leiaf tri gwasanaeth yn cael eu adrodd neu ganu bob dydd, bob wythnos, gyda gwasanaethau canu mewn pump allan o saith diwrnod.

source: Stack Rock Fort
cy: Caer Stack Rock

source: Stack Rock Fort is a fort built on a small island in the Milford Haven Waterway, Pembrokeshire. A 3-gun fort was built between 1850 and 1852, and then upgraded in 1859 with a new building that completely encased the original gun tower. The fort housed three 32-pounder guns, as well as a single 12-pounder for protection of the walls of the dock.
cy: Mae Caer Stack Rock yn gaer wedi’i hadeiladu ar ynys fach yn nghanol dyfrffordd Aberdaugleddau, Sir Benfro. Adeiladwyd caer â 3 gwn rhwng 1850 a 1852, yna bendwrfynon i adeilad newydd oedd yn gorchuddio’r twr gwn gwreiddiol yn 1859. Roedd y caer yn dal tri gwn 32 pwys, yn ogystal â gwn sengl 12 pwys ar gyfer amddiffyn y waliau’r doc.

source: Step counter
cy: Cownter cam

source: Steps
cy: Camau

source: Strumble Head Lighthouse
cy: Goleudy Pen Strumble

source: Strumble Head Lighthouse stands imposingly on Ynysmeicl (St. Michael's Island), an islet to the west of Fishguard, separated from the mainland by a very narrow gap through which the sea boils and froths in stormy weather.
cy: Mae Goleudy Pen Strumble yn sefyll ar Ynysmeicl, i’r dwyrain o Abergwaun, wedi’i wahanu o’r tir mawr gan bwlch cul iawn lle bu’r môr yn taro yn erbyn y tir mewn tywydd stormus.

source: Submit
cy: Cyflwyno

source: Swansea
cy: Abertawe

source: Take part in Educ8's interactive learning experience
cy: Cymerwch ran ym mhrofiad dysgu rhyngweithiol Educ8

source: Tenby
cy: Dinbych-y-Pysgod

source: The city walls are the oldest, longest and most complete in Britain, parts of which are almost 2000 years old. Chester is the only city in Britain that retains the full circuit of its ancient defensive walls. Walking the complete circuit gives wondrous views down into the city and gives a fantastic insight into Chester's long history.
cy: Muriau’r ddinas yw’r hynaf, hiraf a mwyaf poblogaidd ym Mhrydain, rhannau ohonynyt bron yn 2000 oed. Caer yw’r unig ddinas ym Mhrydain sydd wedi cadw cylched lawn ei waliau amddiffynnol. Mae cerdded y gylched gyfan yn rhoi golygfeydd rhyfeddol i lawr i’r ddinas ac yn rhoi mewnwelediad gwych i hanes hir Caer.

source: The Mumbles Pier is one of only six surviving iron piers in Wales. Mumbles Pier was opened to the public on the 10th May 1898. A family run business ‘The Pier’ is one of very few privately owned Piers left in the UK. Once a station for the world famous Mumbles Railway, the site is steeped in a rich history and continues to be a seaside tourist attraction for many families across the UK.
cy: Mae Pier y Mwmbwls yn un o ddim ond chwech phier haearn sydd wedi goroesi yng Nghymru. Agorwyd Pier y Mwmbwls i’r cyhoedd ar y 10fed o Fai 1898. Busnes teulu ‘Y Pier’ yw un o ychydig iawn o pier dan berchnogaeth preifat sydd ar ôl yn y DU. Unwaith yn orsfa ar gyfer y rheilffordd byd-enwog Rheilffordd Mwmbwls, mae gan y safle hanes gyfoethog ac yn parhau i fod yn atyniad twristiaeth glan môr i lawer o deulueodd ledled y DU.

source: The Newport Transporter Bridge is a transporter bridge that crosses the River Usk in Newport, South East Wales. It is one of fewer than 10 transporter bridges that remain in use worldwide; only a few dozen were ever built. It is one of only two operational transporter bridges in Britain, the other being the Tees Transporter Bridge.
cy: Pont Gludo Casnewydd yw’r bont sy’n croesi Afon Usk yng Nghasnewydd, de-ddwyrain Cymru. Mae’n un o lain a 10 pont cludo sy’n parhau i gaele u ddefnyddio ledled y byd; dim ond ychydig ddwsin a adeiladwyd erioed.

source: This Round House was erected in 1834. It was built as a lock-up where drunkards were detained until they became sober. It was also a place of detention pending the transfer of an accused to the nearest place where justice could be administered. The key was kept by the Parish Constable. The building is divided by a partition wall forming two cells of equal dimensions. One cell was reserved for men and the other for women.
cy: Adeiladwyd y Tŷ Crwn yma yn 1834. Adeiladwyd fel lle clo i feddwon cael eu cadw nes eu byd yn sobr. Roedd hefyd yn fan cadw hyd nes trosglwyddo cyhuddedig i’r ardal agosaf lle gellid weinyddu cyfiawnder. Cadwyd yr allwedd gan gwnstabl y plwyf. Mae’r adeilad wedi’i rannu a wal raniad sy’n ffurfio dwy gell o ddimensiynau cyfartal. Neilltuwyd un gell i ddynion a’r llall i ferched.

source: Tintern Abbey was founded on 9 May 1131 by Walter de Clare, Lord of Chepstow. It is situated adjacent to the village of Tintern in Monmouthshire, on the Welsh bank of the River Wye, which at this location forms the border between Monmouthshire in Wales and Gloucestershire in England.
cy: Sefydlwyd Tintern Abbey ar Mai y 9fed 1131 gan Walter de Clare, arglwydd Cas-gwent. Mae wedi ei leoli ger pentref Tintern yn Sir Fynwy, ar lan yr Afon Wye, sydd yn y lleoliad hwn yn ffurfio’r ffin rhwng Sir Fynwy yng Nghymrua a Swydd Gaerloyw yn Lloegr.

source: Transporter Bridge
cy: Pont Gludo Casnewydd

source: Username
cy: Enw defnyddiwr

source: Visit exciting places in and around Wales
cy: Ymweld â lleoedd cyffrous yng Nghymru a'r cyffiniau

source: Welsh coastal walk
cy: Taith gerdded arfordirol Cymru

source: You have walked approximately
cy: Rydych chi wedi cerdded tua

source: © 2021 Copyright:
cy: © 2021 Hawlfraint:
